results/test1/zvol/c/fio-4k.txt
random-write: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=posixaio, iodepth=8
...
fio-3.34
Starting 4 processes
random-write: Laying out IO file (1 file / 4096MiB)
random-write: Laying out IO file (1 file / 4096MiB)
random-write: Laying out IO file (1 file / 4096MiB)
[...]
Jobs: 3 (f=3): [F(2),_(1),F(1)][100.0%][eta 00m:00s]
random-write: (groupid=0, jobs=1): err= 0: pid=1096: Sat Mar 16 17:27:42 2024
  write: IOPS=318, BW=1275KiB/s (1306kB/s)(80.9MiB/64980msec); 0 zone resets
    slat (nsec): min=471, max=62112k, avg=43617.62, stdev=593641.78
    clat (nsec): min=511, max=8785.4M, avg=24085874.98, stdev=292475462.01
     lat (usec): min=21, max=8787.3k, avg=24129.49, stdev=292480.51
    clat percentiles (nsec):
     |  1.00th=[       972],  5.00th=[     14528], 10.00th=[     57600],
     | 20.00th=[    103936], 30.00th=[    179200], 40.00th=[    250880],
     | 50.00th=[    354304], 60.00th=[    497664], 70.00th=[    741376],
     | 80.00th=[   1204224], 90.00th=[   2179072], 95.00th=[   3981312],
     | 99.00th=[ 492830720], 99.50th=[1686110208], 99.90th=[5200936960],
     | 99.95th=[5603590144], 99.99th=[8791261184]
   bw (  KiB/s): min=   71, max=12480, per=100.00%, avg=5170.66, stdev=3964.63, samples=32
   iops        : min=   17, max= 3120, avg=1292.59, stdev=991.17, samples=32
  lat (nsec)   : 750=0.58%, 1000=0.45%
  lat (usec)   : 2=1.23%, 4=1.29%, 10=1.11%, 20=0.75%, 50=2.38%
  lat (usec)   : 100=11.57%, 250=20.63%, 500=20.19%, 750=10.11%, 1000=6.23%
  lat (msec)   : 2=12.22%, 4=6.32%, 10=2.85%, 20=0.75%, 50=0.26%
  lat (msec)   : 100=0.04%, 500=0.07%, 750=0.12%, 1000=0.08%, 2000=0.35%
  lat (msec)   : >=2000=0.42%
  cpu          : usr=0.37%, sys=5.19%, ctx=38276, majf=0, minf=0
  IO depths    : 1=0.7%, 2=4.6%, 4=51.8%, 8=42.9%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=96.3%, 8=3.7%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,20716,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8
random-write: (groupid=0, jobs=1): err= 0: pid=1097: Sat Mar 16 17:27:42 2024
  write: IOPS=312, BW=1251KiB/s (1281kB/s)(79.5MiB/65086msec); 0 zone resets
    slat (nsec): min=541, max=27638k, avg=50467.16, stdev=352821.69
    clat (nsec): min=551, max=8785.0M, avg=24484766.73, stdev=295056563.35
     lat (usec): min=17, max=8785.0k, avg=24535.23, stdev=295055.92
    clat percentiles (nsec):
     |  1.00th=[       860],  5.00th=[      4192], 10.00th=[     54016],
     | 20.00th=[    107008], 30.00th=[    185344], 40.00th=[    268288],
     | 50.00th=[    382976], 60.00th=[    544768], 70.00th=[    790528],
     | 80.00th=[   1236992], 90.00th=[   2179072], 95.00th=[   3915776],
     | 99.00th=[ 492830720], 99.50th=[1686110208], 99.90th=[5133828096],
     | 99.95th=[5603590144], 99.99th=[8791261184]
   bw (  KiB/s): min=   38, max=12744, per=100.00%, avg=5082.66, stdev=3334.06, samples=32
   iops        : min=    9, max= 3186, avg=1270.59, stdev=833.54, samples=32
  lat (nsec)   : 750=0.65%, 1000=0.65%
  lat (usec)   : 2=2.04%, 4=1.55%, 10=1.47%, 20=1.08%, 50=1.92%
  lat (usec)   : 100=9.69%, 250=18.76%, 500=19.89%, 750=10.95%, 1000=6.82%
  lat (msec)   : 2=13.14%, 4=6.50%, 10=2.81%, 20=0.80%, 50=0.22%
  lat (msec)   : 500=0.07%, 750=0.12%, 1000=0.08%, 2000=0.35%, >=2000=0.43%
  cpu          : usr=0.36%, sys=5.31%, ctx=40130, majf=0, minf=0
  IO depths    : 1=0.8%, 2=5.0%, 4=52.0%, 8=42.2%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=96.2%, 8=3.8%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,20363,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8
random-write: (groupid=0, jobs=1): err= 0: pid=1098: Sat Mar 16 17:27:42 2024
  write: IOPS=289, BW=1158KiB/s (1186kB/s)(73.4MiB/64868msec); 0 zone resets
    slat (nsec): min=541, max=38776k, avg=50896.06, stdev=491035.31
    clat (nsec): min=591, max=8759.1M, avg=26542263.08, stdev=306960922.18
     lat (usec): min=20, max=8759.3k, avg=26593.16, stdev=306960.83
    clat percentiles (nsec):
     |  1.00th=[      1012],  5.00th=[     11584], 10.00th=[     57600],
     | 20.00th=[    118272], 30.00th=[    199680], 40.00th=[    280576],
     | 50.00th=[    395264], 60.00th=[    561152], 70.00th=[    839680],
     | 80.00th=[   1302528], 90.00th=[   2375680], 95.00th=[   4292608],
     | 99.00th=[ 692060160], 99.50th=[1971322880], 99.90th=[5133828096],
     | 99.95th=[5603590144], 99.99th=[8791261184]
   bw (  KiB/s): min=   55, max=12840, per=96.41%, avg=4687.03, stdev=3599.38, samples=32
   iops        : min=   13, max= 3210, avg=1171.69, stdev=899.88, samples=32
  lat (nsec)   : 750=0.41%, 1000=0.56%
  lat (usec)   : 2=1.36%, 4=1.13%, 10=1.36%, 20=1.09%, 50=2.25%
  lat (usec)   : 100=9.40%, 250=19.12%, 500=20.19%, 750=10.61%, 1000=7.06%
  lat (msec)   : 2=13.10%, 4=6.95%, 10=2.99%, 20=0.91%, 50=0.37%
  lat (msec)   : 100=0.01%, 500=0.04%, 750=0.17%, 1000=0.09%, 2000=0.38%
  lat (msec)   : >=2000=0.47%
  cpu          : usr=0.34%, sys=4.85%, ctx=35425, majf=0, minf=0
  IO depths    : 1=0.6%, 2=4.8%, 4=52.1%, 8=42.4%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=96.2%, 8=3.8%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,18778,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8
random-write: (groupid=0, jobs=1): err= 0: pid=1099: Sat Mar 16 17:27:42 2024
  write: IOPS=296, BW=1185KiB/s (1213kB/s)(75.2MiB/64980msec); 0 zone resets
    slat (nsec): min=481, max=45461k, avg=60036.49, stdev=556531.95
    clat (nsec): min=581, max=8776.3M, avg=25889170.17, stdev=303457722.45
     lat (usec): min=18, max=8777.4k, avg=25949.21, stdev=303457.96
    clat percentiles (nsec):
     |  1.00th=[       836],  5.00th=[      3632], 10.00th=[     47872],
     | 20.00th=[     87552], 30.00th=[    162816], 40.00th=[    236544],
     | 50.00th=[    333824], 60.00th=[    477184], 70.00th=[    708608],
     | 80.00th=[   1204224], 90.00th=[   2211840], 95.00th=[   3915776],
     | 99.00th=[ 700448768], 99.50th=[1686110208], 99.90th=[5200936960],
     | 99.95th=[5603590144], 99.99th=[8791261184]
   bw (  KiB/s): min=   87, max=13600, per=98.80%, avg=4803.06, stdev=4037.74, samples=32
   iops        : min=   21, max= 3400, avg=1200.66, stdev=1009.48, samples=32
  lat (nsec)   : 750=0.69%, 1000=0.69%
  lat (usec)   : 2=1.95%, 4=1.84%, 10=1.52%, 20=0.98%, 50=2.88%
  lat (usec)   : 100=11.44%, 250=19.69%, 500=19.61%, 750=10.00%, 1000=5.61%
  lat (msec)   : 2=11.61%, 4=6.65%, 10=2.45%, 20=0.85%, 50=0.42%
  lat (msec)   : 100=0.01%, 750=0.21%, 1000=0.08%, 2000=0.37%, >=2000=0.46%
  cpu          : usr=0.34%, sys=4.76%, ctx=36260, majf=0, minf=0
  IO depths    : 1=0.7%, 2=4.9%, 4=52.2%, 8=42.2%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=96.2%, 8=3.8%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,19244,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8

Run status group 0 (all jobs):
  WRITE: bw=4861KiB/s (4978kB/s), 1158KiB/s-1275KiB/s (1186kB/s-1306kB/s), io=309MiB (324MB), run=64868-65086msec