results/test1/zvol/c/fio-512.txt
random-write: (g=0): rw=randwrite, bs=(R) 512B-512B, (W) 512B-512B, (T) 512B-512B, ioengine=posixaio, iodepth=8
...
fio-3.34
Starting 4 processes
random-write: Laying out IO file (1 file / 4096MiB)
random-write: Laying out IO file (1 file / 4096MiB)
random-write: Laying out IO file (1 file / 4096MiB)
[...]
Jobs: 4 (f=4): [w(4)][0.3%][eta 05h:32m:08s]
random-write: (groupid=0, jobs=1): err= 0: pid=1103: Sat Mar 16 17:45:32 2024
  write: IOPS=422, BW=211KiB/s (216kB/s)(12.7MiB/61575msec); 0 zone resets
    slat (nsec): min=230, max=31957k, avg=52602.25, stdev=371253.97
    clat (nsec): min=541, max=8358.5M, avg=18692551.85, stdev=258562254.18
     lat (usec): min=16, max=8358.5k, avg=18745.15, stdev=258560.91
    clat percentiles (nsec):
     |  1.00th=[      1160],  5.00th=[      5856], 10.00th=[     51968],
     | 20.00th=[    108032], 30.00th=[    177152], 40.00th=[    240640],
     | 50.00th=[    325632], 60.00th=[    436224], 70.00th=[    618496],
     | 80.00th=[    937984], 90.00th=[   1859584], 95.00th=[   3457024],
     | 99.00th=[  19529728], 99.50th=[1216348160], 99.90th=[4328521728],
     | 99.95th=[6341787648], 99.99th=[8355053568]
   bw (  KiB/s): min=    6, max= 1885, per=91.21%, avg=812.91, stdev=504.50, samples=32
   iops        : min=   13, max= 3770, avg=1625.94, stdev=1008.86, samples=32
  lat (nsec)   : 750=0.23%, 1000=0.48%
  lat (usec)   : 2=1.60%, 4=2.00%, 10=1.61%, 20=1.44%, 50=2.35%
  lat (usec)   : 100=8.77%, 250=23.00%, 500=22.52%, 750=10.89%, 1000=6.37%
  lat (msec)   : 2=9.54%, 4=5.04%, 10=2.92%, 20=0.26%, 50=0.18%
  lat (msec)   : 750=0.15%, 1000=0.06%, 2000=0.25%, >=2000=0.34%
  cpu          : usr=0.47%, sys=4.64%, ctx=51114, majf=0, minf=0
  IO depths    : 1=0.9%, 2=5.9%, 4=52.3%, 8=40.9%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=95.6%, 8=4.4%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,26025,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8
random-write: (groupid=0, jobs=1): err= 0: pid=1104: Sat Mar 16 17:45:32 2024
  write: IOPS=454, BW=227KiB/s (233kB/s)(13.7MiB/61575msec); 0 zone resets
    slat (nsec): min=390, max=11503k, avg=33758.06, stdev=159782.70
    clat (nsec): min=571, max=8359.1M, avg=17455334.20, stdev=249386909.56
     lat (usec): min=21, max=8359.2k, avg=17489.09, stdev=249386.27
    clat percentiles (nsec):
     |  1.00th=[      1064],  5.00th=[     11584], 10.00th=[     61184],
     | 20.00th=[    118272], 30.00th=[    195584], 40.00th=[    261120],
     | 50.00th=[    346112], 60.00th=[    452608], 70.00th=[    626688],
     | 80.00th=[    946176], 90.00th=[   1761280], 95.00th=[   3260416],
     | 99.00th=[  16580608], 99.50th=[1149239296], 99.90th=[4328521728],
     | 99.95th=[6341787648], 99.99th=[8355053568]
   bw (  KiB/s): min=    7, max= 1961, per=98.06%, avg=873.50, stdev=597.70, samples=32
   iops        : min=   14, max= 3922, avg=1747.09, stdev=1195.31, samples=32
  lat (nsec)   : 750=0.46%, 1000=0.43%
  lat (usec)   : 2=1.32%, 4=1.24%, 10=1.32%, 20=1.00%, 50=1.79%
  lat (usec)   : 100=9.66%, 250=21.32%, 500=24.64%, 750=11.58%, 1000=6.38%
  lat (msec)   : 2=10.14%, 4=4.90%, 10=2.54%, 20=0.37%, 50=0.16%
  lat (msec)   : 750=0.14%, 1000=0.06%, 2000=0.23%, >=2000=0.31%
  cpu          : usr=0.52%, sys=5.13%, ctx=56410, majf=0, minf=0
  IO depths    : 1=0.4%, 2=4.0%, 4=49.6%, 8=46.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=96.8%, 8=3.2%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,27964,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8
random-write: (groupid=0, jobs=1): err= 0: pid=1105: Sat Mar 16 17:45:32 2024
  write: IOPS=436, BW=218KiB/s (224kB/s)(13.1MiB/61576msec); 0 zone resets
    slat (nsec): min=250, max=27676k, avg=43340.91, stdev=320109.01
    clat (nsec): min=572, max=8358.5M, avg=18114662.73, stdev=254459491.32
     lat (usec): min=18, max=8358.5k, avg=18158.00, stdev=254458.41
    clat percentiles (nsec):
     |  1.00th=[      1256],  5.00th=[      9408], 10.00th=[     59136],
     | 20.00th=[    115200], 30.00th=[    191488], 40.00th=[    250880],
     | 50.00th=[    333824], 60.00th=[    440320], 70.00th=[    610304],
     | 80.00th=[    954368], 90.00th=[   1826816], 95.00th=[   3293184],
     | 99.00th=[  16056320], 99.50th=[1216348160], 99.90th=[4328521728],
     | 99.95th=[6341787648], 99.99th=[8355053568]
   bw (  KiB/s): min=    6, max= 1612, per=97.50%, avg=868.03, stdev=530.01, samples=31
   iops        : min=   12, max= 3224, avg=1736.35, stdev=1059.97, samples=31
  lat (nsec)   : 750=0.33%, 1000=0.36%
  lat (usec)   : 2=1.26%, 4=1.58%, 10=1.58%, 20=1.20%, 50=1.93%
  lat (usec)   : 100=9.52%, 250=22.00%, 500=24.29%, 750=10.78%, 1000=6.17%
  lat (msec)   : 2=10.12%, 4=4.97%, 10=2.64%, 20=0.39%, 50=0.11%
  lat (msec)   : 750=0.14%, 1000=0.06%, 2000=0.24%, >=2000=0.33%
  cpu          : usr=0.50%, sys=4.89%, ctx=53168, majf=0, minf=0
  IO depths    : 1=0.6%, 2=5.2%, 4=51.3%, 8=42.9%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=95.9%, 8=4.1%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,26908,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8
random-write: (groupid=0, jobs=1): err= 0: pid=1106: Sat Mar 16 17:45:32 2024
  write: IOPS=466, BW=233KiB/s (239kB/s)(14.0MiB/61576msec); 0 zone resets
    slat (nsec): min=261, max=22809k, avg=36568.32, stdev=230859.59
    clat (nsec): min=551, max=8358.3M, avg=16981578.82, stdev=246133276.72
     lat (usec): min=18, max=8358.3k, avg=17018.15, stdev=246132.85
    clat percentiles (nsec):
     |  1.00th=[       964],  5.00th=[      3760], 10.00th=[     49920],
     | 20.00th=[    102912], 30.00th=[    185344], 40.00th=[    246784],
     | 50.00th=[    325632], 60.00th=[    432128], 70.00th=[    593920],
     | 80.00th=[    888832], 90.00th=[   1712128], 95.00th=[   3227648],
     | 99.00th=[  13828096], 99.50th=[1149239296], 99.90th=[4328521728],
     | 99.95th=[6341787648], 99.99th=[8355053568]
   bw (  KiB/s): min=    8, max= 1834, per=100.00%, avg=898.28, stdev=609.44, samples=32
   iops        : min=   16, max= 3669, avg=1796.72, stdev=1218.86, samples=32
  lat (nsec)   : 750=0.49%, 1000=0.57%
  lat (usec)   : 2=2.20%, 4=1.88%, 10=1.56%, 20=0.94%, 50=2.35%
  lat (usec)   : 100=9.55%, 250=20.90%, 500=24.65%, 750=10.98%, 1000=6.37%
  lat (msec)   : 2=9.29%, 4=4.51%, 10=2.59%, 20=0.29%, 50=0.17%
  lat (msec)   : 100=0.01%, 750=0.14%, 1000=0.06%, 2000=0.22%, >=2000=0.31%
  cpu          : usr=0.51%, sys=5.16%, ctx=57277, majf=0, minf=0
  IO depths    : 1=0.6%, 2=4.4%, 4=50.4%, 8=44.6%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=96.5%, 8=3.5%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,28739,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8

Run status group 0 (all jobs):
  WRITE: bw=890KiB/s (912kB/s), 211KiB/s-233KiB/s (216kB/s-239kB/s), io=53.5MiB (56.1MB), run=61575-61576msec